docs/evidence/qa/k6-output.txt

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/


     execution: local
        script: tests/load/k6-qa.js
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 1m30s max duration (incl. graceful stop):
              * default: Up to 30 looping VUs for 1m0s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/30 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 01/30 VUs  0m01.0s/1m00.0s

running (0m02.0s), 01/30 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 01/30 VUs  0m02.0s/1m00.0s

running (0m03.0s), 02/30 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 02/30 VUs  0m03.0s/1m00.0s

running (0m04.0s), 02/30 VUs, 1 complete and 0 interrupted iterations
default   [   7% ] 02/30 VUs  0m04.0s/1m00.0s

running (0m05.0s), 02/30 VUs, 1 complete and 0 interrupted iterations
default   [   8% ] 02/30 VUs  0m05.0s/1m00.0s

running (0m06.0s), 03/30 VUs, 3 complete and 0 interrupted iterations
default   [  10% ] 03/30 VUs  0m06.0s/1m00.0s

running (0m07.0s), 03/30 VUs, 3 complete and 0 interrupted iterations
default   [  12% ] 03/30 VUs  0m07.0s/1m00.0s

running (0m08.0s), 04/30 VUs, 6 complete and 0 interrupted iterations
default   [  13% ] 04/30 VUs  0m08.0s/1m00.0s

running (0m09.0s), 04/30 VUs, 6 complete and 0 interrupted iterations
default   [  15% ] 04/30 VUs  0m09.0s/1m00.0s

running (0m10.0s), 04/30 VUs, 8 complete and 0 interrupted iterations
default   [  17% ] 04/30 VUs  0m10.0s/1m00.0s

running (0m11.0s), 05/30 VUs, 10 complete and 0 interrupted iterations
default   [  18% ] 05/30 VUs  0m11.0s/1m00.0s

running (0m12.0s), 06/30 VUs, 10 complete and 0 interrupted iterations
default   [  20% ] 06/30 VUs  0m12.0s/1m00.0s

running (0m13.0s), 07/30 VUs, 15 complete and 0 interrupted iterations
default   [  22% ] 07/30 VUs  0m13.0s/1m00.0s

running (0m14.0s), 07/30 VUs, 16 complete and 0 interrupted iterations
default   [  23% ] 07/30 VUs  0m14.0s/1m00.0s

running (0m15.0s), 08/30 VUs, 21 complete and 0 interrupted iterations
default   [  25% ] 08/30 VUs  0m15.0s/1m00.0s

running (0m16.0s), 09/30 VUs, 22 complete and 0 interrupted iterations
default   [  27% ] 09/30 VUs  0m16.0s/1m00.0s

running (0m17.0s), 10/30 VUs, 26 complete and 0 interrupted iterations
default   [  28% ] 10/30 VUs  0m17.0s/1m00.0s

running (0m18.0s), 10/30 VUs, 31 complete and 0 interrupted iterations
default   [  30% ] 10/30 VUs  0m18.0s/1m00.0s

running (0m19.0s), 11/30 VUs, 33 complete and 0 interrupted iterations
default   [  32% ] 11/30 VUs  0m19.0s/1m00.0s

running (0m20.0s), 12/30 VUs, 40 complete and 0 interrupted iterations
default   [  33% ] 12/30 VUs  0m20.0s/1m00.0s

running (0m21.0s), 13/30 VUs, 43 complete and 0 interrupted iterations
default   [  35% ] 13/30 VUs  0m21.0s/1m00.0s

running (0m22.0s), 13/30 VUs, 51 complete and 0 interrupted iterations
default   [  37% ] 13/30 VUs  0m22.0s/1m00.0s

running (0m23.0s), 14/30 VUs, 54 complete and 0 interrupted iterations
default   [  38% ] 14/30 VUs  0m23.0s/1m00.0s

running (0m24.0s), 15/30 VUs, 61 complete and 0 interrupted iterations
default   [  40% ] 15/30 VUs  0m24.0s/1m00.0s

running (0m25.0s), 16/30 VUs, 67 complete and 0 interrupted iterations
default   [  42% ] 16/30 VUs  0m25.0s/1m00.0s

running (0m26.0s), 16/30 VUs, 73 complete and 0 interrupted iterations
default   [  43% ] 16/30 VUs  0m26.0s/1m00.0s

running (0m27.0s), 17/30 VUs, 81 complete and 0 interrupted iterations
default   [  45% ] 17/30 VUs  0m27.0s/1m00.0s

running (0m28.0s), 18/30 VUs, 86 complete and 0 interrupted iterations
default   [  47% ] 18/30 VUs  0m28.0s/1m00.0s

running (0m29.0s), 19/30 VUs, 96 complete and 0 interrupted iterations
default   [  48% ] 19/30 VUs  0m29.0s/1m00.0s

running (0m30.0s), 19/30 VUs, 102 complete and 0 interrupted iterations
default   [  50% ] 19/30 VUs  0m30.0s/1m00.0s

running (0m31.0s), 20/30 VUs, 111 complete and 0 interrupted iterations
default   [  52% ] 20/30 VUs  0m31.0s/1m00.0s

running (0m32.0s), 20/30 VUs, 119 complete and 0 interrupted iterations
default   [  53% ] 20/30 VUs  0m32.0s/1m00.0s

running (0m33.0s), 21/30 VUs, 127 complete and 0 interrupted iterations
default   [  55% ] 21/30 VUs  0m33.0s/1m00.0s

running (0m34.0s), 21/30 VUs, 137 complete and 0 interrupted iterations
default   [  57% ] 21/30 VUs  0m34.0s/1m00.0s

running (0m35.0s), 22/30 VUs, 145 complete and 0 interrupted iterations
default   [  58% ] 22/30 VUs  0m35.0s/1m00.0s

running (0m36.0s), 22/30 VUs, 157 complete and 0 interrupted iterations
default   [  60% ] 22/30 VUs  0m36.0s/1m00.0s

running (0m37.0s), 23/30 VUs, 165 complete and 0 interrupted iterations
default   [  62% ] 23/30 VUs  0m37.0s/1m00.0s

running (0m38.0s), 23/30 VUs, 175 complete and 0 interrupted iterations
default   [  63% ] 23/30 VUs  0m38.0s/1m00.0s

running (0m39.0s), 24/30 VUs, 184 complete and 0 interrupted iterations
default   [  65% ] 24/30 VUs  0m39.0s/1m00.0s

running (0m40.0s), 24/30 VUs, 194 complete and 0 interrupted iterations
default   [  67% ] 24/30 VUs  0m40.0s/1m00.0s

running (0m41.0s), 25/30 VUs, 206 complete and 0 interrupted iterations
default   [  68% ] 25/30 VUs  0m41.0s/1m00.0s

running (0m42.0s), 25/30 VUs, 215 complete and 0 interrupted iterations
default   [  70% ] 25/30 VUs  0m42.0s/1m00.0s

running (0m43.0s), 26/30 VUs, 229 complete and 0 interrupted iterations
default   [  72% ] 26/30 VUs  0m43.0s/1m00.0s

running (0m44.0s), 26/30 VUs, 238 complete and 0 interrupted iterations
default   [  73% ] 26/30 VUs  0m44.0s/1m00.0s

running (0m45.0s), 27/30 VUs, 248 complete and 0 interrupted iterations
default   [  75% ] 27/30 VUs  0m45.0s/1m00.0s

running (0m46.0s), 27/30 VUs, 259 complete and 0 interrupted iterations
default   [  77% ] 27/30 VUs  0m46.0s/1m00.0s

running (0m47.0s), 28/30 VUs, 272 complete and 0 interrupted iterations
default   [  78% ] 28/30 VUs  0m47.0s/1m00.0s

running (0m48.0s), 28/30 VUs, 284 complete and 0 interrupted iterations
default   [  80% ] 28/30 VUs  0m48.0s/1m00.0s

running (0m49.0s), 29/30 VUs, 294 complete and 0 interrupted iterations
default   [  82% ] 29/30 VUs  0m49.0s/1m00.0s

running (0m50.0s), 29/30 VUs, 310 complete and 0 interrupted iterations
default   [  83% ] 29/30 VUs  0m50.0s/1m00.0s

running (0m51.0s), 30/30 VUs, 321 complete and 0 interrupted iterations
default   [  85% ] 30/30 VUs  0m51.0s/1m00.0s

running (0m52.0s), 30/30 VUs, 334 complete and 0 interrupted iterations
default   [  87% ] 30/30 VUs  0m52.0s/1m00.0s

running (0m53.0s), 28/30 VUs, 345 complete and 0 interrupted iterations
default   [  88% ] 28/30 VUs  0m53.0s/1m00.0s

running (0m54.0s), 25/30 VUs, 359 complete and 0 interrupted iterations
default   [  90% ] 25/30 VUs  0m54.0s/1m00.0s

running (0m55.0s), 21/30 VUs, 371 complete and 0 interrupted iterations
default   [  92% ] 21/30 VUs  0m55.0s/1m00.0s

running (0m56.0s), 15/30 VUs, 381 complete and 0 interrupted iterations
default   [  93% ] 15/30 VUs  0m56.0s/1m00.0s

running (0m57.0s), 12/30 VUs, 391 complete and 0 interrupted iterations
default   [  95% ] 12/30 VUs  0m57.0s/1m00.0s

running (0m58.0s), 10/30 VUs, 395 complete and 0 interrupted iterations
default   [  97% ] 10/30 VUs  0m58.0s/1m00.0s

running (0m59.0s), 08/30 VUs, 401 complete and 0 interrupted iterations
default   [  98% ] 08/30 VUs  0m59.0s/1m00.0s

running (1m00.0s), 04/30 VUs, 405 complete and 0 interrupted iterations
default   [ 100% ] 04/30 VUs  1m00.0s/1m00.0s

running (1m01.0s), 03/30 VUs, 406 complete and 0 interrupted iterations
default ↓ [ 100% ] 04/30 VUs  1m0s


  █ THRESHOLDS

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<1000' p(95)=613.09ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS

    checks_total.......: 1227    20.049006/s
    checks_succeeded...: 100.00% 1227 out of 1227
    checks_failed......: 0.00%   0 out of 1227

    ✓ /health returns 200
    ✓ /api/transactions returns 200
    ✓ /api/metrics returns 200

    HTTP
    http_req_duration..............: avg=604.86ms min=585.02ms med=603.58ms max=830.66ms p(90)=609.91ms p(95)=613.09ms
      { expected_response:true }...: avg=604.86ms min=585.02ms med=603.58ms max=830.66ms p(90)=609.91ms p(95)=613.09ms
    http_req_failed................: 0.00%  0 out of 1227
    http_reqs......................: 1227   20.049006/s

    EXECUTION
    iteration_duration.............: avg=2.33s    min=2.29s    med=2.31s    max=3.2s     p(90)=2.34s    p(95)=2.5s
    iterations.....................: 409    6.683002/s
    vus............................: 3      min=1         max=30
    vus_max........................: 30     min=30        max=30

    NETWORK
    data_received..................: 1.8 MB 30 kB/s
    data_sent......................: 110 kB 1.8 kB/s



running (1m01.2s), 00/30 VUs, 409 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/30 VUs  1m0s